mafeiGitHub/stm32Mp3/Bsp/cLcd.cpp
// cLcd.cpp
//{{{  includes
#include <string>
#include <sstream>
#include <iostream>
#include <iomanip>

#include "stm32746g_discovery.h"
#include "cLcd.h"
#include "cLcdPrivate.h"

#include "cmsis_os.h"
#include "../sys/cpuUsage.h"

#include <ft2build.h>
#include FT_FREETYPE_H

extern int freeSansBold_len;
extern const uint8_t freeSansBold[64228];
//}}}
//{{{  defines
#define ABS(X) ((X) > 0 ? (X) : -(X))

#define LCD_DISP_PIN           GPIO_PIN_12
#define LCD_DISP_GPIO_PORT     GPIOI

#define LCD_BL_CTRL_PIN        GPIO_PIN_3
#define LCD_BL_CTRL_GPIO_PORT  GPIOK

// DMA2D CR reg bits
#define DMA2D_CR_MASK      ((uint32_t)0xFFFC3F07)  // unused bits mask
#define DMA2D_CR_START     ((uint32_t)0x00000001)  // Start transfer
#define DMA2D_CR_SUSP      ((uint32_t)0x00000002)  // Suspend transfer
#define DMA2D_CR_ABORT     ((uint32_t)0x00000004)  // Abort transfer
#define DMA2D_CR_TEIE      ((uint32_t)0x00000100)  // Transfer Error Interrupt Enable
#define DMA2D_CR_TCIE      ((uint32_t)0x00000200)  // Transfer Complete Interrupt Enable
#define DMA2D_CR_TWIE      ((uint32_t)0x00000400)  // Transfer Watermark Interrupt Enable
#define DMA2D_CR_CAEIE     ((uint32_t)0x00000800)  // CLUT Access Error Interrupt Enable
#define DMA2D_CR_CTCIE     ((uint32_t)0x00001000)  // CLUT Transfer Complete Interrupt Enable
#define DMA2D_CR_CEIE      ((uint32_t)0x00002000)  // Configuration Error Interrupt Enable
#define DMA2D_CR_MODE      ((uint32_t)0x00030000)  // DMA2D Mode mask
#define DMA2D_CR_M2M       ((uint32_t)0x00000000)  // - DMA2D memory to memory transfer mode
#define DMA2D_CR_M2M_PFC   ((uint32_t)0x00010000)  // - DMA2D memory to memory with pixel format conversion transfer mode
#define DMA2D_CR_M2M_BLEND ((uint32_t)0x00020000)  // - DMA2D memory to memory with blending transfer mode
#define DMA2D_CR_R2M       ((uint32_t)0x00030000)  // - DMA2D register to memory transfer mode

#define DMA2D_ARGB8888     ((uint32_t)0x00000000)  // ARGB8888 DMA2D color mode
#define DMA2D_RGB888       ((uint32_t)0x00000001)  // RGB888 DMA2D color mode
#define DMA2D_RGB565       ((uint32_t)0x00000002)  // RGB565 DMA2D color mode
#define DMA2D_ARGB1555     ((uint32_t)0x00000003)  // ARGB1555 DMA2D color mode
#define DMA2D_ARGB4444     ((uint32_t)0x00000004)  // ARGB4444 DMA2D color mode

#define CM_ARGB8888        ((uint32_t)0x00000000)  // ARGB8888 color mode
#define CM_RGB888          ((uint32_t)0x00000001)  // RGB888 color mode
#define CM_RGB565          ((uint32_t)0x00000002)  // RGB565 color mode
#define CM_ARGB1555        ((uint32_t)0x00000003)  // ARGB1555 color mode
#define CM_ARGB4444        ((uint32_t)0x00000004)  // ARGB4444 color mode
#define CM_L8              ((uint32_t)0x00000005)  // L8 color mode
#define CM_AL44            ((uint32_t)0x00000006)  // AL44 color mode
#define CM_AL88            ((uint32_t)0x00000007)  // AL88 color mode
#define CM_L4              ((uint32_t)0x00000008)  // L4 color mode
#define CM_A8              ((uint32_t)0x00000009)  // A8 color mode
#define CM_A4              ((uint32_t)0x0000000A)  // A4 color mode
//}}}
//{{{  static vars
static uint32_t curFrameBufferAddress;
static uint32_t setFrameBufferAddress[2];
static uint32_t showFrameBufferAddress[2];
static uint8_t showAlpha[2];

//{{{  struct tLTDC
typedef struct {
  osSemaphoreId sem;
  uint32_t timeouts;
  uint32_t lineIrq;
  uint32_t fifoUnderunIrq;
  uint32_t transferErrorIrq;
  uint32_t lastTicks;
  uint32_t lineTicks;
  uint32_t frameWait;
  } tLTDC;
//}}}
static tLTDC ltdc;

static osSemaphoreId DmaSem;
static uint32_t* DmaIsrBuf;

#define maxChars 0x60
//{{{  struct tFontChar
typedef struct {
  uint8_t* bitmap;
  int16_t left;
  int16_t top;
  int16_t pitch;
  int16_t rows;
  int16_t advance;
  } tFontChar;
//}}}
static tFontChar* chars[maxChars];

static FT_Library FTlibrary;
static FT_Face FTface;
static FT_GlyphSlot FTglyphSlot;
//}}}
#define DMA_BUF (uint32_t*)0x20000000

LTDC_HandleTypeDef hLtdc;
//{{{
void LCD_LTDC_IRQHandler() {

  if (LTDC->ISR & LTDC_IT_FU) ltdc.fifoUnderunIrq++;
  if (LTDC->ISR & LTDC_IT_TE) ltdc.transferErrorIrq++;

  // line interrupt
  if (LTDC->ISR & LTDC_IT_LI) {
    // switch showFrameBuffer
    LTDC_Layer_TypeDef* ltdcLayer = (LTDC_Layer_TypeDef*)((uint32_t)LTDC + 0x84); // + (0x80*layer));
    ltdcLayer->CFBAR = showFrameBufferAddress[0];
    if (showAlpha[0]) {
      ltdcLayer->CR |= LTDC_LxCR_LEN;
      ltdcLayer->CACR &= ~LTDC_LxCACR_CONSTA;
      ltdcLayer->CACR = showAlpha[0];
      }
    else
      ltdcLayer->CR &= ~LTDC_LxCR_LEN;
    LTDC->SRCR |= LTDC_SRCR_IMR;

    ltdc.lineTicks = osKernelSysTick() - ltdc.lastTicks;
    ltdc.lastTicks = osKernelSysTick();
    ltdc.lineIrq++;

    if (ltdc.frameWait)
      osSemaphoreRelease (ltdc.sem);
    ltdc.frameWait = 0;
    }

  LTDC->ICR = LTDC_FLAG_LI | LTDC_FLAG_FU | LTDC_FLAG_TE;
  }
//}}}
//{{{
void LCD_DMA2D_IRQHandler() {

  // clear interrupt flags
  DMA2D->IFCR = DMA2D_ISR_TCIF | DMA2D_ISR_TEIF | DMA2D_ISR_CEIF;

  switch (*DmaIsrBuf++) {
    case 1: // fill
      DMA2D->OCOLR = *DmaIsrBuf++;  // colour
      DMA2D->OMAR  = *DmaIsrBuf++;  // fb start address
      DMA2D->OOR   = *DmaIsrBuf++;  // stride
      DMA2D->NLR   = *DmaIsrBuf++;  // xlen:ylen
      DMA2D->CR = DMA2D_CR_R2M | DMA2D_CR_TCIE | DMA2D_CR_TEIE | DMA2D_CR_CEIE | DMA2D_CR_START;
      break;

    case 2: // stamp
      DMA2D->FGCOLR = *DmaIsrBuf++; // src color
      DMA2D->OMAR   = *DmaIsrBuf;   // bgnd fb start address
      DMA2D->BGMAR  = *DmaIsrBuf++;
      DMA2D->OOR    = *DmaIsrBuf;   // bgnd stride
      DMA2D->BGOR   = *DmaIsrBuf++;
      DMA2D->NLR    = *DmaIsrBuf++; // xlen:ylen
      DMA2D->FGMAR  = *DmaIsrBuf++; // src start address
      DMA2D->CR = DMA2D_CR_M2M_BLEND | DMA2D_CR_TCIE | DMA2D_CR_TEIE | DMA2D_CR_CEIE | DMA2D_CR_START;
      break;

    default: // normally 0
      // no more opCodes, disable interrupts and release semaphore to signal done
      DMA2D->CR = 0;
      DmaIsrBuf = DMA_BUF;
      osSemaphoreRelease (DmaSem);
      break;
    }
  }
//}}}

