mafeiGitHub/stm32Mp3/Bsp/cLcd.cpp
// cLcd public
//{{{
cLcd::cLcd()  {
  mStartTime = osKernelSysTick();
  updateNumDrawLines();
  }
//}}}
//{{{
void cLcd::init (uint32_t buffer0, uint32_t buffer1, bool interupts) {

  mInterupts = interupts;

  mBuffer[false] = buffer0;
  mBuffer[true] = buffer1;
  mDrawBuffer = !mDrawBuffer;
  ltdcInit (mBuffer[mDrawBuffer]);

  clear (LCD_BLACK);
  sendWait();
  displayOn();

  // font init
  setFont (freeSansBold, freeSansBold_len);
  for (auto i = 0; i < maxChars; i++)
    chars[i] = nullptr;
  }
//}}}

//{{{
void cLcd::setTitle (std::string title) {
  mTitle = title;
  updateNumDrawLines();
  }
//}}}
//{{{
void cLcd::setShowTime (bool enable) {
  mShowTime = enable;
  }
//}}}
//{{{
void cLcd::setShowDebug (bool enable) {
  mShowDebug = enable;
  updateNumDrawLines();
  }
//}}}
//{{{
void cLcd::setShowFooter (bool enable) {
  mShowFooter = enable;
  updateNumDrawLines();
  }
//}}}

//{{{
std::string cLcd::intStr (int value, int width, char fill) {

  std::ostringstream os;
  if (width)
    os << std::setfill (fill) << std::setw (width) << value;
  else
    os << value;
  return os.str();
  }
//}}}
//{{{
std::string cLcd::hexStr (int value, int width) {

  std::ostringstream os;
  if (width)
    os << std::hex << std::setfill ('0') << std::setw (width) << value;
  else
    os << std::hex << value;
  return os.str();
  }
//}}}
//{{{
void cLcd::text (uint32_t colour, std::string str) {

  bool tailing = mLastLine == (int)mFirstLine + mNumDrawLines - 1;

  auto line = (mLastLine < mMaxLine-1) ? mLastLine+1 : mLastLine;
  mLines[line].mTime = osKernelSysTick();
  mLines[line].mColour = colour;
  mLines[line].mString = str;
  mLastLine = line;

  if (tailing)
    mFirstLine = mLastLine - mNumDrawLines + 1;

  if (!mInterupts) {
    startDraw();
    endDraw();
    }
  }
//}}}
//{{{
void cLcd::text (std::string str) {
  text (LCD_WHITE, str);
  }
//}}}

//{{{
void cLcd::pixel (uint32_t col, int16_t x, int16_t y) {

  *(uint32_t*)(curFrameBufferAddress + (y*getWidth() + x)*4) = col;
  }
//}}}
//{{{
void cLcd::pixelClipped (uint32_t col, int16_t x, int16_t y) {

  if ((x >= 0) && (y >= 0) && (x < getWidth()) && (y < getHeight()))
    *(uint32_t*)(curFrameBufferAddress + (y*getWidth() + x)*4) = col;
  }
//}}}
//{{{
void cLcd::rect (uint32_t col, int16_t x, int16_t y, uint16_t xlen, uint16_t ylen) {

  if (!xlen)
    return;
  if (!ylen)
    return;

  *mDmaCurBuf++ = col;                                                 // colour
  *mDmaCurBuf++ = curFrameBufferAddress + ((y * getWidth()) + x) * 4;  // fb start address
  *mDmaCurBuf++ = getWidth() - xlen;                                // stride
  *mDmaCurBuf++ = (xlen << 16) | ylen;                                 // xlen:ylen
  *mDmaCurBuf++ = 0;                                                   // terminate
  *(mDmaCurBuf-6) = 1;                                                 // fill opCode

  if (mDmaCurBuf > mDmaHighWater)
    mDmaHighWater = mDmaCurBuf;
  }
//}}}
//{{{
void cLcd::rectClipped (uint32_t col, int16_t x, int16_t y, uint16_t xlen, uint16_t ylen) {

  if (x >= getWidth())
    return;
  if (y >= getHeight())
    return;

  int xend = x + xlen;
  if (xend <= 0)
    return;

  int yend = y + ylen;
  if (yend <= 0)
    return;

  if (x < 0)
    x = 0;
  if (xend > getWidth())
    xend = getWidth();

  if (y < 0)
    y = 0;
  if (yend > getHeight())
    yend = getHeight();

  rect (col, x, y, xend - x, yend - y);
  }
//}}}
//{{{
void cLcd::rectOutline (uint32_t col, int16_t x, int16_t y, uint16_t xlen, uint16_t ylen) {

  rectClipped (col, x, y, xlen, 1);
  rectClipped (col, x + xlen, y, 1, ylen);
  rectClipped (col, x, y + ylen, xlen, 1);
  rectClipped (col, x, y, 1, ylen);
  }
//}}}
//{{{
void cLcd::clear (uint32_t col) {

  rect (col, 0, 0, getWidth(), getHeight());
  }
//}}}
//{{{
void cLcd::ellipse (uint32_t col, int16_t x, int16_t y, uint16_t xradius, uint16_t yradius) {

  if (!xradius)
    return;
  if (!yradius)
    return;

  int x1 = 0;
  int y1 = -yradius;
  int err = 2 - 2*xradius;
  float k = (float)yradius / xradius;

  do {
    rectClipped (col, (x-(uint16_t)(x1 / k)), y + y1, (2*(uint16_t)(x1 / k) + 1), 1);
    rectClipped (col, (x-(uint16_t)(x1 / k)), y - y1, (2*(uint16_t)(x1 / k) + 1), 1);

    int e2 = err;
    if (e2 <= x1) {
      err += ++x1 * 2 + 1;
      if (-y1 == x && e2 <= y1)
        e2 = 0;
      }
    if (e2 > y1)
      err += ++y1*2 + 1;
    } while (y1 <= 0);
  }
//}}}
//{{{
void cLcd::ellipseOutline (uint32_t col, int16_t x, int16_t y, uint16_t xradius, uint16_t yradius) {

  if (xradius && yradius) {
    int x1 = 0;
    int y1 = -yradius;
    int err = 2 - 2*xradius;
    float k = (float)yradius / xradius;

    do {
      pixelClipped (col, x - (uint16_t)(x1 / k), y + y1);
      pixelClipped (col, x + (uint16_t)(x1 / k), y + y1);
      pixelClipped (col, x + (uint16_t)(x1 / k), y - y1);
      pixelClipped (col, x - (uint16_t)(x1 / k), y - y1);

      int e2 = err;
      if (e2 <= x1) {
        err += ++x1*2 + 1;
        if (-y1 == x1 && e2 <= y1)
          e2 = 0;
        }
      if (e2 > y1)
        err += ++y1*2 + 1;
      } while (y1 <= 0);
    }
  }
//}}}
//{{{
void cLcd::line (uint32_t col, int16_t x1, int16_t y1, int16_t x2, int16_t y2) {

  int16_t deltax = ABS(x2 - x1);        /* The difference between the x's */
  int16_t deltay = ABS(y2 - y1);        /* The difference between the y's */
  int16_t x = x1;                       /* Start x off at the first pixel */
  int16_t y = y1;                       /* Start y off at the first pixel */

  int16_t xinc1;
  int16_t xinc2;
  if (x2 >= x1) {               /* The x-values are increasing */
    xinc1 = 1;
    xinc2 = 1;
    }
  else {                         /* The x-values are decreasing */
    xinc1 = -1;
    xinc2 = -1;
    }

  int yinc1;
  int yinc2;
  if (y2 >= y1) {                 /* The y-values are increasing */
    yinc1 = 1;
    yinc2 = 1;
    }
  else {                         /* The y-values are decreasing */
    yinc1 = -1;
    yinc2 = -1;
    }

  int den = 0;
  int num = 0;
  int num_add = 0;
  int num_pixels = 0;
  if (deltax >= deltay) {        /* There is at least one x-value for every y-value */
    xinc1 = 0;                  /* Don't change the x when numerator >= denominator */
    yinc2 = 0;                  /* Don't change the y for every iteration */
    den = deltax;
    num = deltax / 2;
    num_add = deltay;
    num_pixels = deltax;         /* There are more x-values than y-values */
    }
  else {                         /* There is at least one y-value for every x-value */
    xinc2 = 0;                  /* Don't change the x for every iteration */
    yinc1 = 0;                  /* Don't change the y when numerator >= denominator */
    den = deltay;
    num = deltay / 2;
    num_add = deltax;
    num_pixels = deltay;         /* There are more y-values than x-values */
  }

  for (int curpixel = 0; curpixel <= num_pixels; curpixel++) {
    pixelClipped (col, x, y);   /* Draw the current pixel */
    num += num_add;                            /* Increase the numerator by the top of the fraction */
    if (num >= den) {                          /* Check if numerator >= denominator */
      num -= den;                             /* Calculate the new numerator value */
      x += xinc1;                             /* Change the x as appropriate */
      y += yinc1;                             /* Change the y as appropriate */
      }
    x += xinc2;                               /* Change the x as appropriate */
    y += yinc2;                               /* Change the y as appropriate */
    }
  }
//}}}

