mafeiGitHub/stm32Mp3/Bsp/cLcd.cpp
//{{{
void cLcd::pressed (int pressCount, int x, int y, int xinc, int yinc) {

  if ((pressCount > 30) && (x <= mStringPos) && (y <= mLineInc))
    reset();
  else if (pressCount == 0) {
    if (x <= mStringPos) {
      // set displayFirstLine
      if (y < 2 * mLineInc)
        displayTop();
      else if (y > getHeight() - 2 * mLineInc)
        displayTail();
      }
    }
  else {
    // inc firstLine
    float value = mFirstLine - (yinc / 4.0f);

    if (value < 0)
      mFirstLine = 0;
    else if (mLastLine <= (int)mNumDrawLines-1)
      mFirstLine = 0;
    else if (value > mLastLine - mNumDrawLines + 1)
      mFirstLine = mLastLine - mNumDrawLines + 1;
    else
      mFirstLine = value;
    }
  }
//}}}

//{{{
void cLcd::startDraw() {

  if (mInterupts) {
    mDrawBuffer = !mDrawBuffer;
    setLayer (0, mBuffer[mDrawBuffer]);

    // frameSync;
    ltdc.frameWait = 1;
    if (osSemaphoreWait (ltdc.sem, 100) != osOK)
      ltdc.timeouts++;
    }

  mDrawStartTime = osKernelSysTick();
  clear (LCD_BLACK);
  }
//}}}
//{{{
void cLcd::endDraw() {

  auto y = 0;
  if (!mTitle.empty()) {
    string (LCD_WHITE, mFontHeight, mTitle, 0, y, getWidth(), mLineInc);
    y += mLineInc;
    }

  if (mLastLine >= 0) {
    // draw scroll bar
    auto yorg = mLineInc + ((int)mFirstLine * mNumDrawLines * mLineInc / (mLastLine + 1));
    auto ylen = mNumDrawLines * mNumDrawLines * mLineInc / (mLastLine + 1);
    rectClipped (LCD_YELLOW, 0, yorg, 8, ylen);
    }

  auto lastLine = (int)mFirstLine + mNumDrawLines - 1;
  if (lastLine > mLastLine)
    lastLine = mLastLine;
  for (auto lineIndex = (int)mFirstLine; lineIndex <= lastLine; lineIndex++) {
    auto x = 0;
    if (mShowTime) {
      string (LCD_GREEN, mFontHeight,
              intStr ((mLines[lineIndex].mTime-mStartTime) / 1000) + "." +
              intStr ((mLines[lineIndex].mTime-mStartTime) % 1000, 3, '0'), x, y, getWidth(), mLineInc);
      x += mStringPos;
      }
    string (mLines[lineIndex].mColour, mFontHeight, mLines[lineIndex].mString, x, y, getWidth(), mLineInc);
    y += mLineInc;
    }

  if (mShowDebug) {
    std::string str = intStr (ltdc.lineIrq) + ":f " +
                      intStr (ltdc.lineTicks) + "ms " +
                      intStr (mDmaHighWater-DMA_BUF) + ":hi " +
                      intStr (mDmaTimeouts) + " " +
                      intStr (ltdc.transferErrorIrq) + " " +
                      intStr (ltdc.fifoUnderunIrq);
    string (LCD_WHITE, 20, str, 0, getHeight() - 2 * mLineInc, getWidth(), 24);
    }

  if (mShowFooter)
    string (LCD_YELLOW, mFontHeight,
            intStr (xPortGetFreeHeapSize()) + " " + intStr (osGetCPUUsage()) + "% " + intStr (mDrawTime) + "ms",
            0, getHeight()-mLineInc, getWidth(), mLineInc);

  sendWait();
  if (mInterupts)
    showLayer (0, mBuffer[mDrawBuffer], 255);

  mDrawTime = osKernelSysTick() - mDrawStartTime;
  }
//}}}

//{{{
void cLcd::displayOn() {

  // enable LTDC
  LTDC->GCR |= LTDC_GCR_LTDCEN;

  // turn on DISP pin
  HAL_GPIO_WritePin (LCD_DISP_GPIO_PORT, LCD_DISP_PIN, GPIO_PIN_SET);        /* Assert LCD_DISP pin */

  // turn on backlight
  HAL_GPIO_WritePin (LCD_BL_CTRL_GPIO_PORT, LCD_BL_CTRL_PIN, GPIO_PIN_SET);  /* Assert LCD_BL_CTRL pin */
  }
//}}}
//{{{
void cLcd::displayOff() {

  // disable LTDC
  LTDC->GCR &= ~LTDC_GCR_LTDCEN;

  // turn off DISP pin
  HAL_GPIO_WritePin (LCD_DISP_GPIO_PORT, LCD_DISP_PIN, GPIO_PIN_RESET);      /* De-assert LCD_DISP pin */

  // turn off backlight
  HAL_GPIO_WritePin (LCD_BL_CTRL_GPIO_PORT, LCD_BL_CTRL_PIN, GPIO_PIN_RESET);/* De-assert LCD_BL_CTRL pin */
  }
//}}}

// private
//{{{
void cLcd::ltdcInit (uint32_t frameBufferAddress) {

  //{{{  LTDC, dma2d clock enable
  // enable the LTDC and DMA2D clocks
  __HAL_RCC_LTDC_CLK_ENABLE();
  __HAL_RCC_DMA2D_CLK_ENABLE();

  // enable GPIO clock, includes backlight, display enable
  __HAL_RCC_GPIOE_CLK_ENABLE();
  __HAL_RCC_GPIOG_CLK_ENABLE();
  __HAL_RCC_GPIOI_CLK_ENABLE();
  __HAL_RCC_GPIOJ_CLK_ENABLE();
  __HAL_RCC_GPIOK_CLK_ENABLE();
  //}}}
  //{{{  LTDC pin config
  // GPIOE config
  GPIO_InitTypeDef gpio_init_structure;
  gpio_init_structure.Pin       = GPIO_PIN_4;
  gpio_init_structure.Mode      = GPIO_MODE_AF_PP;
  gpio_init_structure.Pull      = GPIO_NOPULL;
  gpio_init_structure.Speed     = GPIO_SPEED_FAST;
  gpio_init_structure.Alternate = GPIO_AF14_LTDC;
  HAL_GPIO_Init (GPIOE, &gpio_init_structure);

  // GPIOG config
  gpio_init_structure.Pin       = GPIO_PIN_12;
  gpio_init_structure.Mode      = GPIO_MODE_AF_PP;
  gpio_init_structure.Alternate = GPIO_AF9_LTDC;
  HAL_GPIO_Init (GPIOG, &gpio_init_structure);

  // GPIOI LTDC alternate config
  gpio_init_structure.Pin       = GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_10 | GPIO_PIN_13 | GPIO_PIN_14 | GPIO_PIN_15;
  gpio_init_structure.Mode      = GPIO_MODE_AF_PP;
  gpio_init_structure.Alternate = GPIO_AF14_LTDC;
  HAL_GPIO_Init (GPIOI, &gpio_init_structure);

  // GPIOJ config
  gpio_init_structure.Pin       = GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_3 |
                                  GPIO_PIN_4 | GPIO_PIN_5 | GPIO_PIN_6 | GPIO_PIN_7 |
                                  GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_10 | GPIO_PIN_11 | GPIO_PIN_13 | GPIO_PIN_14 | GPIO_PIN_15;
  gpio_init_structure.Mode      = GPIO_MODE_AF_PP;
  gpio_init_structure.Alternate = GPIO_AF14_LTDC;
  HAL_GPIO_Init (GPIOJ, &gpio_init_structure);

  // GPIOK config
  gpio_init_structure.Pin       = GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_4 | GPIO_PIN_5 | GPIO_PIN_6 | GPIO_PIN_7;
  gpio_init_structure.Mode      = GPIO_MODE_AF_PP;
  gpio_init_structure.Alternate = GPIO_AF14_LTDC;
  HAL_GPIO_Init (GPIOK, &gpio_init_structure);

  // LCD_DISP GPIO config
  gpio_init_structure.Pin       = LCD_DISP_PIN;
  gpio_init_structure.Mode      = GPIO_MODE_OUTPUT_PP;
  HAL_GPIO_Init (LCD_DISP_GPIO_PORT, &gpio_init_structure);

  // LCD_BL_CTRL GPIO config
  gpio_init_structure.Pin       = LCD_BL_CTRL_PIN;
  gpio_init_structure.Mode      = GPIO_MODE_OUTPUT_PP;
  HAL_GPIO_Init (LCD_BL_CTRL_GPIO_PORT, &gpio_init_structure);
  //}}}
  //{{{  LTDC timing config
  #define RK043FN48H_WIDTH   480 // LCD PIXEL WIDTH
  #define RK043FN48H_HSYNC   41  // Horizontal synchronization
  #define RK043FN48H_HBP     13  // Horizontal back porch
  #define RK043FN48H_HFP     32  // Horizontal front porch

  #define RK043FN48H_HEIGHT  272 // LCD PIXEL HEIGHT
  #define RK043FN48H_VSYNC   10  // Vertical synchronization
  #define RK043FN48H_VBP     2   // Vertical back porch
  #define RK043FN48H_VFP     2   // Vertical front porch

  hLtdc.Init.HorizontalSync =     RK043FN48H_HSYNC - 1;
  hLtdc.Init.AccumulatedHBP =     RK043FN48H_HSYNC + RK043FN48H_HBP - 1;
  hLtdc.Init.AccumulatedActiveW = RK043FN48H_WIDTH + RK043FN48H_HSYNC + RK043FN48H_HBP - 1;
  hLtdc.Init.TotalWidth =         RK043FN48H_WIDTH + RK043FN48H_HSYNC + RK043FN48H_HBP + RK043FN48H_HFP - 1;

