mafeiGitHub/stm32Mp3/Bsp/cLcd.cpp
  hLtdc.Init.VerticalSync =       RK043FN48H_VSYNC - 1;
  hLtdc.Init.AccumulatedVBP =     RK043FN48H_VSYNC + RK043FN48H_VBP - 1;
  hLtdc.Init.AccumulatedActiveH = RK043FN48H_HEIGHT + RK043FN48H_VSYNC + RK043FN48H_VBP - 1;
  hLtdc.Init.TotalHeigh =         RK043FN48H_HEIGHT + RK043FN48H_VSYNC + RK043FN48H_VBP + RK043FN48H_VFP - 1;

  // - PLLSAI_VCO In  = HSE_VALUE / PLLM                        = 1 Mhz
  // - PLLSAI_VCO Out = PLLSAI_VCO Input * PLLSAIN              = 192 Mhz
  // - PLLLCDCLK      = PLLSAI_VCO Output / PLLSAIR    = 192/5  = 38.4 Mhz
  // - LTDC clock     = PLLLCDCLK / LTDC_PLLSAI_DIVR_4 = 38.4/4 = 9.6Mhz
  RCC_PeriphCLKInitTypeDef periph_clk_init_struct;
  periph_clk_init_struct.PeriphClockSelection = RCC_PERIPHCLK_LTDC;
  periph_clk_init_struct.PLLSAI.PLLSAIN = 192;
  periph_clk_init_struct.PLLSAI.PLLSAIR = 5; // could be 7
  periph_clk_init_struct.PLLSAIDivR = RCC_PLLSAIDIVR_4;
  HAL_RCCEx_PeriphCLKConfig (&periph_clk_init_struct);
  //}}}
  //{{{  LTDC Polarity
  hLtdc.Init.HSPolarity = LTDC_HSPOLARITY_AL;
  hLtdc.Init.VSPolarity = LTDC_VSPOLARITY_AL;
  hLtdc.Init.DEPolarity = LTDC_DEPOLARITY_AL;
  hLtdc.Init.PCPolarity = LTDC_PCPOLARITY_IPC;
  //}}}
  //{{{  LTDC width height
  hLtdc.LayerCfg->ImageWidth = RK043FN48H_WIDTH;
  hLtdc.LayerCfg->ImageHeight = RK043FN48H_HEIGHT;
  //}}}
  //{{{  LTDC Background value
  hLtdc.Init.Backcolor.Blue = 0;
  hLtdc.Init.Backcolor.Green = 0;
  hLtdc.Init.Backcolor.Red = 0;
  //}}}
  hLtdc.Instance = LTDC;
  HAL_LTDC_Init (&hLtdc);

  layerInit (0, frameBufferAddress);
  setFrameBufferAddress[1] = frameBufferAddress;
  showFrameBufferAddress[1] = frameBufferAddress;
  showAlpha[1] = 0;

  //{{{  dma2d init
  // unchanging dma2d regs
  DMA2D->OPFCCR  = DMA2D_ARGB8888; // bgnd fb ARGB
  DMA2D->BGPFCCR = DMA2D_ARGB8888;
  DMA2D->FGPFCCR = CM_A8;          // src alpha
  DMA2D->FGOR    = 0;              // src stride
  //DMA2D->AMTCR = 0x1001;

  // zero out first opcode, point past it
  mDmaCurBuf = DMA_BUF;
  *mDmaCurBuf++ = 0;
  mDmaHighWater = mDmaCurBuf;
  DmaIsrBuf = DMA_BUF;
  mDmaTimeouts = 0;
  //}}}
  if (mInterupts) {
    //{{{  dma2d IRQ init
    osSemaphoreDef (dma2dSem);
    DmaSem = osSemaphoreCreate (osSemaphore (dma2dSem), -1);

    HAL_NVIC_SetPriority (DMA2D_IRQn, 0x05, 0);
    HAL_NVIC_EnableIRQ (DMA2D_IRQn);
    //}}}
    //{{{  LTDC IRQ init
    osSemaphoreDef (ltdcSem);
    ltdc.sem = osSemaphoreCreate (osSemaphore (ltdcSem), -1);

    ltdc.timeouts = 0;
    ltdc.lineIrq = 0;
    ltdc.fifoUnderunIrq = 0;
    ltdc.transferErrorIrq = 0;
    ltdc.lastTicks = 0;
    ltdc.lineTicks = 0;
    ltdc.frameWait = 0;

    HAL_NVIC_SetPriority (LTDC_IRQn, 0xE, 0);
    HAL_NVIC_EnableIRQ (LTDC_IRQn);

    // set line interupt line number
    LTDC->LIPCR = 0;

    // enable line interrupt
    LTDC->IER |= LTDC_IT_LI;
    //}}}
    }
  }
//}}}
//{{{
void cLcd::layerInit (uint8_t layer, uint32_t frameBufferAddress) {

  LTDC_LayerCfgTypeDef* curLayerCfg = &hLtdc.LayerCfg[layer];

  curLayerCfg->WindowX0 = 0;
  curLayerCfg->WindowX1 = getWidth();
  curLayerCfg->WindowY0 = 0;
  curLayerCfg->WindowY1 = getHeight();

  curLayerCfg->PixelFormat = LTDC_PIXEL_FORMAT_ARGB8888;
  curLayerCfg->FBStartAdress = (uint32_t)frameBufferAddress;

  curLayerCfg->Alpha = 255;
  curLayerCfg->Alpha0 = 0;

  curLayerCfg->Backcolor.Blue = 0;
  curLayerCfg->Backcolor.Green = 0;
  curLayerCfg->Backcolor.Red = 0;

  curLayerCfg->BlendingFactor1 = LTDC_BLENDING_FACTOR1_PAxCA;
  curLayerCfg->BlendingFactor2 = LTDC_BLENDING_FACTOR2_PAxCA;

  curLayerCfg->ImageWidth = getWidth();
  curLayerCfg->ImageHeight = getHeight();

  HAL_LTDC_ConfigLayer (&hLtdc, curLayerCfg, layer);

  // local state
  curFrameBufferAddress = frameBufferAddress;
  setFrameBufferAddress[layer] = frameBufferAddress;
  showFrameBufferAddress[layer] = frameBufferAddress;
  showAlpha[layer] = 255;
  }
//}}}
//{{{
void cLcd::setFont (const uint8_t* font, int length) {

  FT_Init_FreeType (&FTlibrary);
  FT_New_Memory_Face (FTlibrary, (FT_Byte*)font, length, 0, &FTface);
  FTglyphSlot = FTface->glyph;
  //FT_Done_Face(face);
  //FT_Done_FreeType (library);
  }
//}}}

//{{{
void cLcd::setLayer (uint8_t layer, uint32_t frameBufferAddress) {

  curFrameBufferAddress = frameBufferAddress;
  setFrameBufferAddress[layer] = frameBufferAddress;
  }
//}}}
//{{{
void cLcd::showLayer (uint8_t layer, uint32_t frameBufferAddress, uint8_t alpha) {

  showFrameBufferAddress[layer] = frameBufferAddress;
  showAlpha[layer] = alpha;
  }
//}}}

//{{{
void cLcd::stamp (uint32_t col, uint8_t* src, int16_t x, int16_t y, uint16_t xlen, uint16_t ylen) {

  if (xlen && ylen) {
    if (y + ylen > getHeight()) // bottom yclip
      ylen = getHeight() - y;

    *mDmaCurBuf++ = col;                                                    // colour
    *mDmaCurBuf++ = curFrameBufferAddress + ((y * getWidth()) + x) * 4;  // bgnd fb start address
    *mDmaCurBuf++ = getWidth() - xlen;                                   // stride
    *mDmaCurBuf++ = (xlen << 16) | ylen;                                    // xlen:ylen
    *mDmaCurBuf++ = (uint32_t)src;                                          // src start address
    *mDmaCurBuf++ = 0;                                                      // terminate
    *(mDmaCurBuf-7) = 2;                                                    // stamp opCode

    if (mDmaCurBuf > mDmaHighWater)
      mDmaHighWater = mDmaCurBuf;
    }
  }
//}}}
//{{{
int cLcd::string (uint32_t col, int fontHeight, std::string str, int16_t x, int16_t y, uint16_t xlen, uint16_t ylen) {

  for (unsigned int i = 0; i < str.size(); i++) {
    if ((str[i] >= 0x20) && (str[i] <= 0x7F)) {
      auto fontChar = chars[str[i] - 0x20];
      if (!fontChar) {
        FT_Set_Pixel_Sizes (FTface, 0, fontHeight);
        FT_Load_Char (FTface, str[i], FT_LOAD_RENDER);

        // cache char info
        fontChar = (tFontChar*)pvPortMalloc (sizeof(tFontChar));
        chars[str[i] - 0x20] = fontChar;
        fontChar->left = FTglyphSlot->bitmap_left;
        fontChar->top = FTglyphSlot->bitmap_top;
        fontChar->pitch = FTglyphSlot->bitmap.pitch;
        fontChar->rows = FTglyphSlot->bitmap.rows;
        fontChar->advance = FTglyphSlot->advance.x / 64;
        fontChar->bitmap = nullptr;

