mafeiGitHub/stm32Mp3/Bsp/cLcd.cpp
        if (FTglyphSlot->bitmap.buffer) {
          // cache char bitmap
          fontChar->bitmap = (uint8_t*)pvPortMalloc (FTglyphSlot->bitmap.pitch * FTglyphSlot->bitmap.rows);
          memcpy (fontChar->bitmap, FTglyphSlot->bitmap.buffer, FTglyphSlot->bitmap.pitch * FTglyphSlot->bitmap.rows);
          }
        }

      if (x + fontChar->left + fontChar->pitch > getWidth())
        break;
      else if (fontChar->bitmap)
        stamp (col, fontChar->bitmap, x + fontChar->left, y + fontHeight - fontChar->top, fontChar->pitch, fontChar->rows);

      x += fontChar->advance;
      }
    }

  return x;
  }
//}}}

//{{{
void cLcd::send() {

  // send first opCode using IRQhandler
  LCD_DMA2D_IRQHandler();
  }
//}}}
//{{{
void cLcd::wait() {

  if (osSemaphoreWait (DmaSem, 500) != osOK)
    mDmaTimeouts++;

  // zero out first opcode, point past it
  mDmaCurBuf = DMA_BUF;
  *mDmaCurBuf++ = 0;
  }
//}}}
//{{{
void cLcd::sendWait() {

  if (mInterupts) {
    send();
    wait();
    }
  else {
     DMA2D->IFCR |= DMA2D_IFSR_CTEIF | DMA2D_IFSR_CTCIF | DMA2D_IFSR_CTWIF|
                     DMA2D_IFSR_CCAEIF | DMA2D_IFSR_CCTCIF | DMA2D_IFSR_CCEIF;

    while (true) {
      auto opCode = *DmaIsrBuf++;
      if (opCode == 1) { // fill
        DMA2D->OCOLR = *DmaIsrBuf++;  // colour
        DMA2D->OMAR  = *DmaIsrBuf++;  // fb start address
        DMA2D->OOR   = *DmaIsrBuf++;  // stride
        DMA2D->NLR   = *DmaIsrBuf++;  // xlen:ylen
        DMA2D->CR = DMA2D_CR_R2M | DMA2D_CR_TCIE | DMA2D_CR_TEIE | DMA2D_CR_CEIE | DMA2D_CR_START;
        while (!(DMA2D->ISR & DMA2D_ISR_TCIF)) {}
        DMA2D->IFCR |= DMA2D_IFSR_CTEIF | DMA2D_IFSR_CTCIF | DMA2D_IFSR_CTWIF|
                       DMA2D_IFSR_CCAEIF | DMA2D_IFSR_CCTCIF | DMA2D_IFSR_CCEIF;
        }
      else if (opCode == 2) { // stamp
        DMA2D->FGCOLR = *DmaIsrBuf++; // src color
        DMA2D->OMAR   = *DmaIsrBuf;   // bgnd fb start address
        DMA2D->BGMAR  = *DmaIsrBuf++;
        DMA2D->OOR    = *DmaIsrBuf;   // bgnd stride
        DMA2D->BGOR   = *DmaIsrBuf++;
        DMA2D->NLR    = *DmaIsrBuf++; // xlen:ylen
        DMA2D->FGMAR  = *DmaIsrBuf++; // src start address
        DMA2D->CR = DMA2D_CR_M2M_BLEND | DMA2D_CR_TCIE | DMA2D_CR_TEIE | DMA2D_CR_CEIE | DMA2D_CR_START;
        while (!(DMA2D->ISR & DMA2D_ISR_TCIF)) {}
        DMA2D->IFCR |= DMA2D_IFSR_CTEIF | DMA2D_IFSR_CTCIF | DMA2D_IFSR_CTWIF|
                       DMA2D_IFSR_CCAEIF | DMA2D_IFSR_CCTCIF | DMA2D_IFSR_CCEIF;
        }
      else { // normally 0
        DMA2D->CR = 0;
        DmaIsrBuf = DMA_BUF;
        mDmaCurBuf = DMA_BUF;
        *mDmaCurBuf++ = 0;
        break;
        }
      }
    }
  }
//}}}

//{{{
void cLcd::reset() {

  for (auto i = 0; i < mMaxLine; i++)
    mLines[i].clear();

  mStartTime = osKernelSysTick();
  mLastLine = -1;
  mFirstLine = 0;
  }
//}}}
//{{{
void cLcd::displayTop() {
  mFirstLine = 0;
  }
//}}}
//{{{
void cLcd::displayTail() {

  if (mLastLine > (int)mNumDrawLines-1)
    mFirstLine = mLastLine - mNumDrawLines + 1;
  else
    mFirstLine = 0;
  }
//}}}
//{{{
void cLcd::updateNumDrawLines() {

  mStringPos = mLineInc*3;

  auto numDrawLines = getHeight() / mLineInc;
  if (!mTitle.empty())
    numDrawLines--;
  if (mShowDebug)
    numDrawLines--;
  if (mShowFooter)
    numDrawLines--;

  mNumDrawLines = numDrawLines;
  }
//}}}
